apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_isolation.c
/****************************************************************************
 * arch/xtensa/src/esp32s3/esp32s3_isolation.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Permission control that a protected build and a kernel build share: the
 * violation interrupt, and the peripheral permissions.  Everything here
 * concerns the WORLD0 (privileged) / WORLD1 (unprivileged) split and is
 * independent of how the user memory itself is laid out, which is what
 * separates the two build models.
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>

#include <nuttx/irq.h>
#include <nuttx/nuttx.h>
#include <nuttx/sched.h>

#ifdef CONFIG_ESP32S3_USERFAULT_ABORT
#include <signal.h>
#include <arch/irq.h>
#include <arch/xtensa/xtensa_corebits.h>
#endif

#include <assert.h>
#include <debug.h>

#include "chip.h"
#include "xtensa.h"
#include "esp_attr.h"
#include "esp_irq.h"
#include "esp32s3_isolation.h"
#include "esp32s3_addrenv.h"
#include "esp32s3_pms.h"
#include "esp32s3_spiram.h"
#include "esp32s3_wcl.h"
#include "hardware/esp32s3_rom_layout.h"
#include "hardware/esp32s3_sensitive.h"
#include "hardware/esp32s3_soc.h"

#include "soc/extmem_reg.h"

#ifdef CONFIG_ESP32S3_USERFAULT_ABORT
#include "sched/sched.h"
#include "signal/signal.h"
#endif

#ifndef CONFIG_BUILD_FLAT

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifdef CONFIG_BUILD_KERNEL
/* The WORLD1 vector table is one Xtensa vector table: 1 KB. */

#  define WORLD1_VECTORS_SIZE  0x400
#endif

/****************************************************************************
 * Public Data
 ****************************************************************************/

#ifdef CONFIG_BUILD_KERNEL

/* The WORLD1 vector table (esp32s3_world1_vectors.S), which the linker
 * script places at the 1 KB alignment a vector base requires.
 */

extern uint8_t _world1_vectors[];

/* The end of the kernel's instruction memory, and so the line that divides
 * Internal SRAM1 between the instruction and the data bus.  The linker
 * script aligns it to the 256 bytes a split line needs.
 */

extern uint8_t _iram_end[];

/* Vectors in the kernel's own table.  Fetching one of these switches the CPU
 * to WORLD0 once it is registered as a World Controller entry address.
 */

extern void _user_exception_vector(void);
extern void _xtensa_level3_vector(void);
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_USERFAULT_ABORT

/****************************************************************************
 * Name: pms_clear_violations
 *
 * Description:
 *   Acknowledge and re-arm every PMS violation monitor.  The monitors raise
 *   a level-triggered interrupt, so the latch must be cleared (pulse the CLR
 *   bit) before returning from the ISR or the interrupt re-fires forever.
 *
 ****************************************************************************/

static void IRAM_ATTR pms_clear_violations(void)
{
  /* IRAM0 / DRAM0 / PIF monitors: pulse VIOLATE_CLR (keeping VIOLATE_EN). */

  modifyreg32(SENSITIVE_CORE_0_IRAM0_PMS_MONITOR_1_REG, 0,
              SENSITIVE_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_CLR_M);
  modifyreg32(SENSITIVE_CORE_0_IRAM0_PMS_MONITOR_1_REG,
              SENSITIVE_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_CLR_M, 0);

  modifyreg32(SENSITIVE_CORE_0_DRAM0_PMS_MONITOR_1_REG, 0,
              SENSITIVE_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_CLR_M);
  modifyreg32(SENSITIVE_CORE_0_DRAM0_PMS_MONITOR_1_REG,
              SENSITIVE_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_CLR_M, 0);

  modifyreg32(SENSITIVE_CORE_0_PIF_PMS_MONITOR_1_REG, 0,
              SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_CLR_M);
  modifyreg32(SENSITIVE_CORE_0_PIF_PMS_MONITOR_1_REG,
              SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_CLR_M, 0);

  /* Flash instruction/data cache reject monitors. */

  modifyreg32(EXTMEM_CORE0_ACS_CACHE_INT_CLR_REG, 0,
              EXTMEM_CORE0_IBUS_REJECT_INT_CLR_M |
              EXTMEM_CORE0_DBUS_REJECT_INT_CLR_M);
  modifyreg32(EXTMEM_CORE0_ACS_CACHE_INT_CLR_REG,
              EXTMEM_CORE0_IBUS_REJECT_INT_CLR_M |
              EXTMEM_CORE0_DBUS_REJECT_INT_CLR_M, 0);
}
#endif

/****************************************************************************
 * Name: pms_violation_isr
 *
 * Description:
 *   This is the common PMS interrupt handler. It will be invoked the PMS
 *   detects an access violation.
 *
 * Parameters:
 *   cpuint        - CPU interrupt index
 *   context       - Context data from the ISR
 *   arg           - Opaque pointer to the internal driver state structure.
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/

static int IRAM_ATTR pms_violation_isr(int cpuint, void *context, void *arg)
{
#ifdef CONFIG_ESP32S3_USERFAULT_ABORT
  uint32_t *regs = (uint32_t *)context;

  /* Acknowledge and re-arm the monitors first so the level-triggered
   * interrupt does not immediately re-fire while we handle it.
   */

