apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_isolation.c
  pms_clear_violations();

  /* An ESP32-S3 PMS permission violation is asynchronous (unlike the precise
   * cache-attribute faults).  If the interruptee was an unprivileged (user)
   * WORLD1 task -- its saved PS carries the User Mode bit -- terminate only
   * that task with SIGSEGV instead of the whole system.  The IRQ dispatch
   * return path applies the up_schedule_sigaction() redirect.
   */

  if (regs != NULL && (regs[REG_PS] & PS_UM) != 0)
    {
      struct tcb_s *tcb = this_task();
      siginfo_t     info;

      _alert("SIGSEGV (PMS) task %s: PC=%08x\n",
             get_task_name(tcb), (unsigned)regs[REG_PC]);

      info.si_signo           = SIGSEGV;
      info.si_code            = SI_USER;
      info.si_errno           = 0;
      info.si_value.sival_ptr = NULL;

      nxsig_tcbdispatch(tcb, &info, false);
      return OK;
    }
#endif

  /* Privileged (WORLD0) violation, or abort disabled: not survivable. */

  PANIC();

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s3_isolation_revoke_peripherals
 ****************************************************************************/

void esp32s3_isolation_revoke_peripherals(void)
{
  /* Revoke User access permission to every peripheral */

  esp32s3_pms_configure_peripheral(PMS_UART1, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_I2C, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_MISC, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_IO_MUX, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_RTC, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_FE, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_FE2, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_GPIO, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_G0SPI_0, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_G0SPI_1, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_UART, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_SYSTIMER, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_TIMERGROUP1, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_TIMERGROUP, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_BB, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_LEDC, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_RMT, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_UHCI0, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_I2C_EXT0, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_BT, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_PWR, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_WIFIMAC, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_RWBT, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_I2S1, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_CAN, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_APB_CTRL, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_SPI_2, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_WORLD_CONTROLLER, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_DIO, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_AD, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_CACHE_CONFIG, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_DMA_COPY, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_INTERRUPT, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_SENSITIVE, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_SYSTEM, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_BT_PWR, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_APB_ADC, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_CRYPTO_DMA, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_CRYPTO_PERI, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_USB_WRAP, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_USB_DEVICE, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_I2S0, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_HINF, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_PWM0, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_BACKUP, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_SLC, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_PCNT, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_SLCHOST, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_UART2, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_PWM1, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_SDIO_HOST, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_I2C_EXT1, PMS_WORLD_1,
                                   PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_SPI_3, PMS_WORLD_1, PMS_ACCESS_NONE);
  esp32s3_pms_configure_peripheral(PMS_USB, PMS_WORLD_1, PMS_ACCESS_NONE);
}

#ifdef CONFIG_BUILD_KERNEL

/****************************************************************************
 * Name: esp32s3_isolation_worlds
 ****************************************************************************/

