apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_isolation.c
  /* Divide Internal SRAM1 into its instruction and data halves.  The kernel
   * image is linked with its IRAM below _iram_end and its data above the
   * corresponding data-bus address.
   */

  esp32s3_pms_set_sram_main_split_line((uintptr_t)_iram_end);

  esp32s3_pms_configure_irom_access();
  esp32s3_pms_configure_drom_access();

  isolation_configure_iram();
  isolation_configure_dram();

  /* Cached external PSRAM.  Every page of a user process -- text, data and
   * heap alike -- is a page of the pgalloc pool, and that pool is a
   * contiguous physical window of the PSRAM device.  Give WORLD1 exactly
   * that window and nothing else, so the kernel's own PSRAM above and below
   * it is out of reach.  The ACE addresses are physical offsets into the
   * device, which is the same space mm_pgalloc() hands out.
   *
   * These registers were never programmed before, which left PSRAM at its
   * reset value -- open to both worlds -- while the whole of user space
   * lived in it.
   */

  psram_size = esp_spiram_get_size();

  DEBUGASSERT(ESP32S3_PGPOOL_PEND <= psram_size);

  esp32s3_pms_set_sram_split_line(PMS_SPLIT_LINE_0, 0,
                                  ESP32S3_PGPOOL_PBASE);
  esp32s3_pms_set_sram_split_line(PMS_SPLIT_LINE_1, ESP32S3_PGPOOL_PBASE,
                                  ESP32S3_PGPOOL_SIZE);
  esp32s3_pms_set_sram_split_line(PMS_SPLIT_LINE_2, ESP32S3_PGPOOL_PEND,
                                  psram_size - ESP32S3_PGPOOL_PEND);

  /* Region 3 is unused.  Park it at the end of the device with zero length:
   * the TRM forbids overlapping regions, so it cannot be left at zero.
   */

  esp32s3_pms_set_sram_split_line(PMS_SPLIT_LINE_3, psram_size, 0);

  esp32s3_pms_configure_sram_region(PMS_AREA_0, PMS_WORLD_0,
                                    PMS_ACCESS_ALL);
  esp32s3_pms_configure_sram_region(PMS_AREA_1, PMS_WORLD_0,
                                    PMS_ACCESS_ALL);
  esp32s3_pms_configure_sram_region(PMS_AREA_2, PMS_WORLD_0,
                                    PMS_ACCESS_ALL);
  esp32s3_pms_configure_sram_region(PMS_AREA_3, PMS_WORLD_0,
                                    PMS_ACCESS_ALL);

  /* The pool holds text and data pages interleaved, so the grant has to
   * cover both; the ACE cannot separate them at page granularity and W^X
   * within a process is not what this boundary is for.
   */

  esp32s3_pms_configure_sram_region(PMS_AREA_0, PMS_WORLD_1,
                                    PMS_ACCESS_NONE);
  esp32s3_pms_configure_sram_region(PMS_AREA_1, PMS_WORLD_1,
                                    PMS_ACCESS_ALL);
  esp32s3_pms_configure_sram_region(PMS_AREA_2, PMS_WORLD_1,
                                    PMS_ACCESS_NONE);
  esp32s3_pms_configure_sram_region(PMS_AREA_3, PMS_WORLD_1,
                                    PMS_ACCESS_NONE);

  /* Cached external flash.  A user process whose text was copied into PSRAM
   * needs nothing from flash -- but one running XIP does, so this cannot
   * simply deny every region.  Until the XIP case carries its own split
   * line between the kernel image and the mapped application, WORLD1 keeps
   * no flash access and XIP is unsupported here.
   */

  esp32s3_pms_configure_flash_cache_region(PMS_AREA_0, PMS_WORLD_0,
                                           PMS_ACCESS_ALL);
  esp32s3_pms_configure_flash_cache_region(PMS_AREA_1, PMS_WORLD_0,
                                           PMS_ACCESS_ALL);
  esp32s3_pms_configure_flash_cache_region(PMS_AREA_2, PMS_WORLD_0,
                                           PMS_ACCESS_ALL);
  esp32s3_pms_configure_flash_cache_region(PMS_AREA_3, PMS_WORLD_0,
                                           PMS_ACCESS_ALL);

  esp32s3_pms_configure_flash_cache_region(PMS_AREA_0, PMS_WORLD_1,
                                           PMS_ACCESS_NONE);
  esp32s3_pms_configure_flash_cache_region(PMS_AREA_1, PMS_WORLD_1,
                                           PMS_ACCESS_NONE);
  esp32s3_pms_configure_flash_cache_region(PMS_AREA_2, PMS_WORLD_1,
                                           PMS_ACCESS_NONE);
  esp32s3_pms_configure_flash_cache_region(PMS_AREA_3, PMS_WORLD_1,
                                           PMS_ACCESS_NONE);

  esp32s3_isolation_revoke_peripherals();
}
#endif

/****************************************************************************
 * Name: esp32s3_pmsirqinitialize
 ****************************************************************************/

void esp32s3_pmsirqinitialize(void)
{
  VERIFY(esp_setup_irq(ESP32S3_PERIPH_CORE_0_IRAM0_PMS_MONITOR_VIOLATE,
                       1, ESP_IRQ_TRIGGER_LEVEL, pms_violation_isr, NULL));
  VERIFY(esp_setup_irq(ESP32S3_PERIPH_CORE_0_DRAM0_PMS_MONITOR_VIOLATE,
                       1, ESP_IRQ_TRIGGER_LEVEL, pms_violation_isr, NULL));
  VERIFY(esp_setup_irq(ESP32S3_PERIPH_CACHE_CORE0_ACS,
                       1, ESP_IRQ_TRIGGER_LEVEL, pms_violation_isr, NULL));
  VERIFY(esp_setup_irq(ESP32S3_PERIPH_CORE_0_PIF_PMS_MONITOR_VIOLATE,
                       1, ESP_IRQ_TRIGGER_LEVEL, pms_violation_isr, NULL));

  up_enable_irq(ESP32S3_IRQ_CORE_0_IRAM0_PMS_MONITOR_VIOLATE);
  up_enable_irq(ESP32S3_IRQ_CORE_0_DRAM0_PMS_MONITOR_VIOLATE);
  up_enable_irq(ESP32S3_IRQ_CACHE_CORE0_ACS);
  up_enable_irq(ESP32S3_IRQ_CORE_0_PIF_PMS_MONITOR_VIOLATE);
}

#endif /* !CONFIG_BUILD_FLAT */
